chat_system_1922743776_actor_description=Benin foreman. Striking dwarves' foreman.
chat_system_1922743776_snap_4_question=^?^So, have you taken our demands to the king?
chat_system_1922743776_snap_4_answer_0=^?^No, I haven't visited Torn Digor yet.
chat_system_1922743776_snap_4_answer_1=^?^Yes, I talked to him. You can get back to work. The king agreed to shorten the workweek during wartime.
chat_system_1922743776_snap_5_question=^?^I knew it! I was sure that Our Majesty couldn't refuse our demands. Yea, he likes to wave a hammer in the smithy, our king. Not like yours. He understands what the workers need!<br>[reward]
chat_system_1922743776_snap_5_answer_0=^?^You're welcome! Goodbye.
chat_system_1922743776_snap_0_question=^?^What are you hanging around here for? Can't you see we're on strike?!
chat_system_1922743776_snap_0_answer_0=^?^Dwarves? On strike? I always thought you work all day, half the night, then dream of your smithy until morning.
chat_system_1922743776_snap_1_question=^?^Judge for yourself. Have you ever heard of anything like this: the dwarves who work aboveground have a 50-hour workweek. Down below here we have a 60-hour week, on account of our comfortable conditions. Of course, that's fair and all, because at the surface it's not as comfortable as it is here in the mines.<br>But now the situation has changed, since we have to fight the Demons. And I - I mean we - now claim workweek equalization with those on the surface! 50-hour workweek! 50-hour workweek!
chat_system_1922743776_snap_1_answer_0=^?^What a problem you have here...
chat_system_1922743776_snap_2_question=^?^Look, human, maybe you'll help some simple underground workers? We've written a plea to the king, where we've stated all of our demands. Maybe you'd, you know, take it to the capital, to Torn Digor? We're afraid of his anger, and you're a stranger, so he won't do anything to you. We'll even pay you for your courage.<br>[reward]
chat_system_1922743776_snap_2_answer_0=^?^To the King Torn Digor? Ok, I'll deliver your petition.
chat_system_1922743776_snap_2_answer_1=^?^No, I can't do that right now.
chat_system_1922743776_snap_3_question=^?^Hey, you again, human? Aren't you going to the capital?
chat_system_1922743776_snap_3_answer_0=^?^Yes, I'm going to go there. Tell me again, what's your problem here?
chat_system_1922743776_snap_6_question=^?^Thank you, human, for your help.
chat_system_1922743776_snap_6_answer_0=^?^You're welcome. Good Luck!
